wieker/electrolyser/mcu/nrf52/fuse-gpio-v1/adc_logic.c
//
// Created by wieker on 6/7/21.
//

#include "adc_logic.h"

/** @file
 * @defgroup nrf_adc_example main.c
 * @{
 * @ingroup nrf_adc_example
 * @brief ADC Example Application main file.
 *
 * This file contains the source code for a sample application using ADC.
 *
 * @image html example_board_setup_a.jpg "Use board setup A for this example."
 */

#include <stdbool.h>
#include <string.h>
#include "nrf.h"
#include "nrf_drv_saadc.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_timer.h"
#include "nrf_delay.h"
#include "ble_lbs.h"

nrf_saadc_value_t     adc_buffer[SAMPLES_IN_BUFFER];
nrf_saadc_value_t     bfr_to_send[6];

void send_adc(nrf_saadc_value_t *vls, int size);

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
  if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
  {
    bfr_to_send[0] = adc_buffer[0];
    bfr_to_send[1] = adc_buffer[20];
    bfr_to_send[2] = adc_buffer[50];
    bfr_to_send[3] = adc_buffer[79];
      send_adc(bfr_to_send, 6);
  }
}



void saadc_init(void)
{
  nrf_saadc_channel_config_t channel_config_V =
          NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN4);
  channel_config_V.gain = SAADC_CH_CONFIG_GAIN_Gain2;
  channel_config_V.reference = SAADC_CH_CONFIG_REFSEL_Internal;

  nrf_drv_saadc_init(NULL, saadc_callback);

  nrf_saadc_resolution_set(NRF_SAADC_RESOLUTION_10BIT);

  nrfx_saadc_channel_init(0, &channel_config_V);

  nrf_saadc_continuous_mode_enable(2000);
  nrfx_saadc_buffer_convert(adc_buffer, 80);
  nrfx_saadc_sample();
}

/** @} */

